In [1]:
#Importo as bibliotecas
import pandas as pd
import numpy as np

In [2]:
#Leio o arquivo e monto a database
dfGeral = pd.read_csv('funcionarios_dados_ti.csv', delimiter=';', encoding='latin1')
dfGeral.head(2)

,ï»¿Nome,Cargo,Salario,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,Ana Souza,Cientista de Dados,12000,NaN,NaN,NaN,NaN,NaN
1,Bruno Lima,Engenheiro de Dados,11500,NaN,NaN,NaN,NaN,NaN

In [3]:
#Apaga as colunas sem valor
dfGeral.drop(columns=['Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7'],inplace=True)
dfGeral.head(2)

      ï»¿Nome                Cargo  Salario
0   Ana Souza   Cientista de Dados    12000
1  Bruno Lima  Engenheiro de Dados    11500

In [4]:
#Crio o array com os valores da coluna salário
array_salarios = np.array(dfGeral["Salario"])
array_salarios

array([12000, 11500, 10500, 13000,  9800, 13500, 11800, 10200, 10800,
       14000, 12500,  9700, 11000, 10100, 10900, 13200, 14500, 11900,
        9900, 12700])

In [5]:
#Calculo a média
mediaSalarios = np.mean(array_salarios)
print(f'Média = {mediaSalarios:.2f}')

Média = 11675.00

In [6]:
#Calculo a mediana
medianaSalarios = np.median(array_salarios)
print(f'Mediana = {medianaSalarios:.2f}')

Mediana = 11650.00

In [7]:
#Calculo a distância relativa
distanciaRelativaSalarios = (mediaSalarios - medianaSalarios) / medianaSalarios
print(f'Distância relativa dos salários = {distanciaRelativaSalarios * 100} %')             #Resultado em porcentagem
print(f'Distância relativa dos salários = {round(distanciaRelativaSalarios * 100, 2)} %')   #Resultado em porcentagem

Distância relativa dos salários = 0.2145922746781116 %
Distância relativa dos salários = 0.21 %

In [ ]:
################################################################################
#RESULTADO:
#O resultado da média é confiável, pois a distância calculada é de apenas 0,21%.
#Nesse caso, a média sofre pouca influência de valores extremos para baixo!
################################################################################